building.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-24 Fri 10:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building Clasp</title>
<meta name="author" content="Alex Wood" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/><link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/></head>
<body>
<div id="preamble" class="status">
<div id="top-menu">
<ul>
<li><a href="index.html">Clasp</a>
<ul>
<li><a href="news.html">News</a></li>
<li><a href="download.html">Download</a></li>
</ul></li>
<li><a href="index.html">Doc</a>
<ul>
<li><a href="license.html">License</a></li>
<li><a href="manual.html">Manual</a></li>
<li><a href="building.html">Building</a></li>
<li><a href="clbind-doc.html">Exposing C++ Libraries</a></li>
</ul></li>
<li><a href="index.html">Misc</a>
<ul>
<li><a href="community.html">Community</a></li>
<li><a href="projects.html">Projects</a></li>
<li><a href="media.html">Media</a></li>
<li><a href="acknowlegements.html">Acknowledgements</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="content" class="content">
<h1 class="title">Building Clasp</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgff03d6c">1. Requirements</a>
<ul>
<li><a href="#org0b86bf9">1.1. Arch</a></li>
<li><a href="#org0af7a87">1.2. Debian/Ubuntu</a></li>
<li><a href="#orgb594c11">1.3. Fedora</a></li>
<li><a href="#org15c2e33">1.4. MacOS</a></li>
</ul>
</li>
<li><a href="#orgb0cdf71">2. Building and Installing</a>
<ul>
<li><a href="#org215c4ac">2.1. WSL2 (Windows Subsystem For Linux 2) notes</a></li>
</ul>
</li>
<li><a href="#org971557e">3. Variants</a></li>
<li><a href="#org03cbb56">4. Targets</a></li>
<li><a href="#orgba5c2bd">5. Extensions</a></li>
<li><a href="#orgb6336c7">6. Configuration</a></li>
</ul>
</div>
</div>
<p>
This page documents the steps needed to build and install Clasp using the source build system which uses a Lisp based metabuilder called koga that outputs <a href="https://ninja-build.org/">Ninja</a> build files.
</p>

<div id="outline-container-orgff03d6c" class="outline-2">
<h2 id="orgff03d6c"><span class="section-number-2">1.</span> Requirements</h2>
<div class="outline-text-2" id="text-1">
<p>
The build requirements of clasp must be installed before beginning the build. For each OS listed below install the packages as listed. Currently, LLVM-14 is required. If your system does not provide LLVM-14 via its package manager then you will need to build it first.
</p>
</div>

<div id="outline-container-org0b86bf9" class="outline-3">
<h3 id="org0b86bf9"><span class="section-number-3">1.1.</span> Arch</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-shell">pacman -S binutils boost clang gmp fmt libunwind llvm ninja sbcl
</pre>
</div>
</div>
</div>

<div id="outline-container-org0af7a87" class="outline-3">
<h3 id="org0af7a87"><span class="section-number-3">1.2.</span> Debian/Ubuntu</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-shell">apt install -y binutils-gold clang-14 libclang-14-dev libfmt-dev libboost-dev libclang-cpp14-dev libelf-dev libgmp-dev libunwind-dev llvm-14 ninja-build sbcl pkg-config
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb594c11" class="outline-3">
<h3 id="orgb594c11"><span class="section-number-3">1.3.</span> Fedora</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-shell">dnf install boost-devel clang elfutils-libelf-devel fmt-devel gmp-devel libunwind-devel llvm-devel ninja-build sbcl
</pre>
</div>
</div>
</div>

<div id="outline-container-org15c2e33" class="outline-3">
<h3 id="org15c2e33"><span class="section-number-3">1.4.</span> MacOS</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-shell">brew install boost gmp fmt libunwind-headers llvm ninja pkg-config sbcl
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb0cdf71" class="outline-2">
<h2 id="orgb0cdf71"><span class="section-number-2">2.</span> Building and Installing</h2>
<div class="outline-text-2" id="text-2">
<p>
Start with a clean Clasp clone (<a href="https://github.com/clasp-developers/clasp">https://github.com/clasp-developers/clasp</a>) on the <code>main</code> branch. Then execute the following steps&#x2026;
</p>

<ol class="org-ol">
<li>Configure the system and create the build files with <code>./koga</code>. ArchLinux may require <code>./koga --broken-stdlib</code> due an outstanding issue with LLVM14's JSON implementation.</li>
<li>Build the system with <code>ninja -C build</code></li>
<li>Install the system with <code>sudo ninja -C build install</code></li>
</ol>
</div>

<div id="outline-container-org215c4ac" class="outline-3">
<h3 id="org215c4ac"><span class="section-number-3">2.1.</span> WSL2 (Windows Subsystem For Linux 2) notes</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>exposeClasses1.cc</code> uses a lot of memory to compile.  On Windows machines with 16GB running WSL2 we see that compilation get killed because it uses too much memory.  Try <code>ninja -j 4 -C build</code> or <code>ninja -j 2 -C build</code> to see if it will build without getting killed.
</p>
</div>
</div>
</div>

<div id="outline-container-org971557e" class="outline-2">
<h2 id="org971557e"><span class="section-number-2">3.</span> Variants</h2>
<div class="outline-text-2" id="text-3">
<p>
The default build target is <code>cclasp-boehmprecise</code>. This builds iclasp, then aclasp, then bclasp, then cclasp using the Boehm garbage collector in precise mode. The suffix after the dash is a called a variant. The current available variants are:
</p>

<ul class="org-ul">
<li>boehm - Boehm garbage collector</li>
<li>boehmprecise - Boehm garbage collector in precise mode</li>
<li>boehm-d - Boehm garbage collector with debugging symbols</li>
<li>boehmprecise-d - Boehm garbage collector in precise mode with debugging symbols</li>
<li>preciseprep - MPS garbage collector. This is only used to analyze Clasp in preparation for the static analyzer.</li>
<li>preciseprep-d - MPS garbage collector with debugging symbols. This is only used to analyze Clasp in preparation for the static analyzer.</li>
</ul>
</div>
</div>

<div id="outline-container-org03cbb56" class="outline-2">
<h2 id="org03cbb56"><span class="section-number-2">4.</span> Targets</h2>
<div class="outline-text-2" id="text-4">
<p>
There are many intermediate and additional targets available in the Ninja build files. The following is a list of some of the significant ones.
</p>

<ul class="org-ul">
<li>install: Install the default target. If Jupyter was enabled by koga then this will install Jupyter system kernels also.</li>
<li>test-[variant]: Run the Clasp regression tests on the specified variant.</li>
<li>jupyter-[variant]: Install Jupyter user kernels for the specified variant. The clasp binaries used will be the ones in the build directory. This target is primarily used for using JupyterLab in a development repository.</li>
<li>analyze-[boehm|boehm-d]: Run the static analyzer on the Boehm collector.</li>
</ul>
</div>
</div>

<div id="outline-container-orgba5c2bd" class="outline-2">
<h2 id="orgba5c2bd"><span class="section-number-2">5.</span> Extensions</h2>
<div class="outline-text-2" id="text-5">
<p>
The <a href="https://github.com/clasp-developers/seqan-clasp/">seqan-clasp</a> and <a href="https://github.com/cando-developers/cando/">cando</a> extensions are compatible with koga. To enable these extensions, create a file <code>config.sexp</code> in the root of the clasp directory with the following contents, then execute the build instructions listed in the previous section.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(:extensions (:cando :seqan-clasp))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb6336c7" class="outline-2">
<h2 id="orgb6336c7"><span class="section-number-2">6.</span> Configuration</h2>
<div class="outline-text-2" id="text-6">
<p>
If the configure script does not succeed in configuring the build or if you want to adjust the settings you use a plist in <code>config.sexp</code>
with the following values. These options can also be passed directly to koga via command line options. For example executing <code>./koga --debug-lexical-depth</code> is equivalent to adding <code>:debug-lexical-depth t</code> to the plist in <code>config.sexp</code>. Extensions can be enabled by passing the names separated with commas, i.e. <code>./koga --extensions=cando,seqan-clasp</code>
</p>

<ul class="org-ul">
<li><code>:skip-sync</code> — A list of repository names to avoid syncing. This is useful if you are doing development on an extension such as Cando.</li>
<li><code>:build-mode</code> — Define how clasp is built. [default :faso]
<ul class="org-ul">
<li><code>:bitcode</code> compiles to bitcode and thinLTO is used to link everything.
This gives the fastest product but linking takes a long time.</li>
<li><code>:object</code> produces object files and regular linking is used.
This is probably not as fast as bitcode (maybe a few percent slower)
but it links fast.</li>
<li><code>:faso</code> generates faso files. This is good for development.</li>
<li><code>:fasobc</code> generates fasobc files.</li>
<li><code>:fasoll</code> generates fasoll files.</li>
<li><code>:fasl</code> generates fasl files.</li>
</ul></li>
<li><code>:build-path</code> — The path for build files such as the Ninja build file. 
[default #P"build/"]</li>
<li><code>:parallel-build</code> — Build clasp in parallel. [default t]</li>
<li><code>:prefix</code> — Where Clasp is install. [default "<i>usr</i>"]</li>
<li><code>:extensions</code> — A list of extensions. [default nil]</li>
<li><code>:jupyter</code> — Enable installation of Jupyter kernels. [default nil]</li>
<li><code>:cst</code> — [default t]</li>
<li><code>:clang-cpp</code> — If t use clang-cpp otherwise use the individual clang 
libraries. [default t]</li>
<li><code>:compile-file-parallel</code> — [default t]</li>
<li><code>:force-startup-external-linkage</code> — Use external-linkage for startup 
functions. [default t]</li>
<li><code>:unwinder</code> — [default :gcc]</li>
<li><code>:jobs</code> — The number of jobs during build. If not specified then a value will
be picked based on the number of CPU cores. [default nil]</li>
<li><code>:always-inline-mps-allocations)</code> —</li>
<li><code>:address-sanitizer</code> — [default nil]</li>
<li><code>:memory-sanitizer</code> — [default nil]</li>
<li><code>:thread-sanitizer</code> — [default nil]</li>
<li><code>:debug-dtree-interpreter</code> — Generate dtree interpreter log [default nil]</li>
<li><code>:debug-dtrace-lock-probe</code> — Add a Dtrace probe for mutex lock acquisition
[default nil]</li>
<li><code>:debug-stackmaps</code> — print messages about stackmap registration [default nil]</li>
<li><code>:debug-assert</code> — Turn on DEBUG<sub>ASSERT</sub> [default t]</li>
<li><code>:debug-assert-type-cast</code> — Turn on type checking when passing arguments
[default nil]</li>
<li><code>:source-debug</code> — Allow LOG messages to print - works with CLASP<sub>DEBUG</sub> 
environment variable [default nil]</li>
<li><code>:debug-jit-log-symbols</code> — Generate a log of JITted symbols in 
<code>/tmp/clasp-symbols-&lt;pid&gt;</code> [default nil]</li>
<li><code>:debug-guard</code> — Add guards around allocated objects [default nil]</li>
<li><code>:debug-guard-validate</code> — Add quick checking of guards [default nil]</li>
<li><code>:debug-guard-backtrace</code> — Add allocation backtraces to guards [default nil]</li>
<li><code>:debug-guard-exhaustive-validate</code> — Add exhaustive, slow, checks of guards
[default nil]</li>
<li><code>:debug-trace-interpreted-closures</code> — [default nil]</li>
<li><code>:debug-environments</code> — [default nil]</li>
<li><code>:debug-release</code> — Turn off optimization for a few C++ functions; undef this 
to optimize everything [default nil]</li>
<li><code>:debug-cache</code> — Debug the dispatch caches - see cache.cc [default nil]</li>
<li><code>:debug-bitunit-container</code> — Prints debug info for bitunit containers 
[default nil]</li>
<li><code>:debug-lexical-depth</code> — Generate tests for lexical closure depths 
[default nil]</li>
<li><code>:debug-flow-tracker</code> — Record small backtraces to track flow [default nil]</li>
<li><code>:debug-dynamic-binding-stack</code> — dynamic variable binding debugging
[default nil]</li>
<li><code>:debug-values</code> — turn on printing <code>(values x y z)</code> values when 
<code>core:*debug-values*</code> is not nil [default nil]</li>
<li><code>:debug-ihs</code> — [default nil]</li>
<li><code>:debug-track-unwinds</code> — Count cc<sub>unwind</sub> calls and report in TIME 
[default nil]</li>
<li><code>:debug-no-unwind</code> — Debug intrinsics that say they don't unwind but actually 
do. [default nil]</li>
<li><code>:debug-startup</code> — Generate per-thread logs in <code>/tmp/dispatch-history/**</code> of 
the slow path of fastgf [default nil]</li>
<li><code>:debug-rehash-count</code> — Keep track of the number of times each hash table has 
been rehashed [default nil]</li>
<li><code>:debug-monitor</code> — generate logging messages to a file in /tmp for non-hot 
code [default nil]</li>
<li><code>:debug-monitor-support</code> — Must be enabled with other options - do this 
automatically? [default nil]</li>
<li><code>:debug-memory-profile</code> — Profile memory allocations total size and counter
[default nil]</li>
<li><code>:debug-bclasp-lisp</code> — Generate debugging frames for all bclasp code - like 
declaim [default nil]</li>
<li><code>:debug-cclasp-lisp</code> — Generate debugging frames for all cclasp code - like 
declaim [default t]</li>
<li><code>:debug-count-allocations</code> — count per-thread allocations of instances of 
classes [default nil]</li>
<li><code>:debug-compiler</code> — Turn on compiler debugging [default nil]</li>
<li><code>:debug-verify-modules</code> — Verify LLVM modules before using them [default nil]</li>
<li><code>:debug-long-call-history</code> — The GF call histories used to blow up - this 
triggers an error if they get too long [default nil]</li>
<li><code>:debug-bounds-assert</code> — check bounds [default t]</li>
<li><code>:debug-gfdispatch</code> — debug call history manipulation [default nil]</li>
<li><code>:debug-fastgf</code> — generate slow gf dispatch logging and write out dispatch 
functions to <code>/tmp/dispatch-history-**</code> [default nil]</li>
<li><code>:debug-slot-accessors</code> — GF accessors have extra debugging added to them
[default nil]</li>
<li><code>:debug-threads</code> — [default nil]</li>
<li><code>:debug-stores</code> — insert a call to <code>cc_validate_tagged_pointer</code> everytime 
something is written to memory [default nil]</li>
<li><code>:debug-ensure-valid-object</code> — Defines <code>ENSURE_VALID_OBJECT(x)-&gt;x</code> macro - 
sprinkle these around to run checks on objects [default nil]</li>
<li><code>:debug-quick-validate</code> — quick/cheap validate if on and comprehensive 
validate if not [default nil]</li>
<li><code>:debug-mps-size</code> — check that the size of the MPS object will be calculated 
properly by obj<sub>skip</sub> [default nil]</li>
<li><code>:debug-mps-underscanning</code> — Very expensive - does a 
<code>mps_arena_collect=/=mps_arena_release</code> for each allocation [default nil]</li>
<li><code>:debug-dont-optimize-bclasp</code> — Optimize bclasp by editing llvm-ir 
[default nil]</li>
<li><code>:debug-recursive-allocations</code> — Catch allocations within allocations - MPS 
hates these [default nil]</li>
<li><code>:debug-alloc-alignment</code> — catch misaligned allocations [default nil]</li>
<li><code>:debug-llvm-optimization-level-0</code> — [default nil]</li>
<li><code>:debug-slow</code> — Code runs slower due to checks - undefine to remove checks
[default nil]</li>
<li><code>:human-readable-bitcode</code> — [default nil]</li>
<li><code>:debug-compile-file-output-info</code> — [default nil]</li>
<li><code>:config-var-cool</code> — mps setting [default t]</li>
<li><code>:ar</code> — Pathname of ar binary. [default nil]</li>
<li><code>:cc</code> — Pathname of cc binary. [default nil]</li>
<li><code>:cxx</code> — Pathname of cxx binary. [default nil]</li>
<li><code>:git</code> — Pathname of git binary. [default nil]</li>
<li><code>:llvm-config</code> — Pathname of llvm-config binary. [default nil]</li>
<li><code>:nm</code> — Pathname of nm binary. [default nil]</li>
<li><code>:pkg-config</code> — Pathname of pkg-config binary. [default nil]</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<center><p>
<a href="sitemap.html">Sitemap</a> &#x2014; <a href="license.html">License</a>
</p>
</center>
</div>
</body>
</html>
